# 3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
# Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит
# работу скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на
# экран.
# Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе пользователем
# очередного элемента необходимо реализовать проверку типа элемента и вносить его в список, только если введено число.
# Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
# При этом работа скрипта не должна завершаться.


class ListNumExcept(Exception):
    def __init__(self, text):
        self.text = text

    def __str__(self):
        return self.text


user_list = []
while True:
    user_input = input('Введите числовой элемент списка (stop - выход): ')
    if user_input == 'stop':
        break
    else:
        try:
            # раздербанил введенную строку и склеил обратно, убрав "-" и ".",
            # чтобы проверить на число, но не выбрасывать отрицательные и дробные числа
            if not ''.join((user_input.replace('-', '').split('.'))).isnumeric():
                raise ListNumExcept('Введено не число')
        except ListNumExcept as my_error:
            print(my_error)
        else:
            user_list.append(float(user_input))
print(user_list)
